; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_9)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 - person
	)

  (:init
		(= (x b0) -1)
(= (y b0) 0)
(= (x b1) 8)
(= (y b1) 0)
(= (x b2) -9)
(= (y b2) 0)
(= (x b3) -9)
(= (y b3) 0)
(= (x b4) 6)
(= (y b4) 0)
(= (x b5) -7)
(= (y b5) 0)
(= (x b6) -10)
(= (y b6) 0)
(= (x b7) 5)
(= (y b7) 0)
(= (x b8) -4)
(= (y b8) 0)
(= (x b9) -10)
(= (y b9) 0)
(= (x b10) -8)
(= (y b10) 0)
(= (x b11) 7)
(= (y b11) 0)
(= (x b12) -6)
(= (y b12) 0)

		(= (d p0) 85)
(= (d p1) 24)
(= (d p2) 83)
(= (d p3) 73)
(= (d p4) 88)
(= (d p5) 66)
(= (d p6) 65)
(= (d p7) 7)
(= (d p8) 46)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
		)
	)
)

; plan
1. (go_north_east b0)
   changed: (x b0) from -1 to 0.5, (y b0) from 0 to 1.5
   goals met: 0 of 9
2. (go_north_east b0)
   changed: (x b0) from 0.5 to 2, (y b0) from 1.5 to 3
   goals met: 0 of 9
3. (go_north_east b0)
   changed: (x b0) from 2 to 3.5, (y b0) from 3 to 4.5
   goals met: 0 of 9
4. (go_north_east b0)
   changed: (x b0) from 3.5 to 5, (y b0) from 4.5 to 6
   goals met: 0 of 9
5. (go_north_east b0)
   changed: (x b0) from 5 to 6.5, (y b0) from 6 to 7.5
   goals met: 0 of 9
6. (go_north_east b0)
   changed: (x b0) from 6.5 to 8, (y b0) from 7.5 to 9
   goals met: 0 of 9
7. (go_north_east b0)
   changed: (x b0) from 8 to 9.5, (y b0) from 9 to 10.5
   goals met: 0 of 9
8. (go_north_east b0)
   changed: (x b0) from 9.5 to 11, (y b0) from 10.5 to 12
   goals met: 0 of 9
9. (go_north_east b0)
   changed: (x b0) from 11 to 12.5, (y b0) from 12 to 13.5
   goals met: 0 of 9
10. (go_north_east b0)
   changed: (x b0) from 12.5 to 14, (y b0) from 13.5 to 15
   goals met: 0 of 9
11. (go_north_east b0)
   changed: (x b0) from 14 to 15.5, (y b0) from 15 to 16.5
   goals met: 0 of 9
12. (go_north_east b0)
   changed: (x b0) from 15.5 to 17, (y b0) from 16.5 to 18
   goals met: 0 of 9
13. (go_north_east b0)
   changed: (x b0) from 17 to 18.5, (y b0) from 18 to 19.5
   goals met: 0 of 9
14. (go_north_east b0)
   changed: (x b0) from 18.5 to 20, (y b0) from 19.5 to 21
   goals met: 0 of 9
15. (go_north_east b0)
   changed: (x b0) from 20 to 21.5, (y b0) from 21 to 22.5
   goals met: 0 of 9
16. (go_north_east b0)
   changed: (x b0) from 21.5 to 23, (y b0) from 22.5 to 24
   goals met: 0 of 9
17. (go_west b0)
   changed: (x b0) from 23 to 20
   goals met: 0 of 9
18. (go_west b0)
   changed: (x b0) from 20 to 17
   goals met: 0 of 9
19. (go_west b0)
   changed: (x b0) from 17 to 14
   goals met: 0 of 9
20. (go_west b0)
   changed: (x b0) from 14 to 11
   goals met: 0 of 9
21. (go_west b0)
   changed: (x b0) from 11 to 8
   goals met: 0 of 9
22. (go_west b0)
   changed: (x b0) from 8 to 5
   goals met: 0 of 9
23. (go_west b0)
   changed: (x b0) from 5 to 2
   goals met: 0 of 9
24. (go_west b0)
   changed: (x b0) from 2 to -1
   goals met: 0 of 9
25. (save_person b0 p7)
   added: (saved p7)
   goals met: 1 of 9
26. (go_north_east b0)
   changed: (x b0) from -1 to 0.5, (y b0) from 24 to 25.5
   goals met: 1 of 9
27. (go_north_east b0)
   changed: (x b0) from 0.5 to 2, (y b0) from 25.5 to 27
   goals met: 1 of 9
28. (go_north_east b0)
   changed: (x b0) from 2 to 3.5, (y b0) from 27 to 28.5
   goals met: 1 of 9
29. (go_north_east b0)
   changed: (x b0) from 3.5 to 5, (y b0) from 28.5 to 30
   goals met: 1 of 9
30. (go_north_east b0)
   changed: (x b0) from 5 to 6.5, (y b0) from 30 to 31.5
   goals met: 1 of 9
31. (go_north_east b0)
   changed: (x b0) from 6.5 to 8, (y b0) from 31.5 to 33
   goals met: 1 of 9
32. (go_north_east b0)
   changed: (x b0) from 8 to 9.5, (y b0) from 33 to 34.5
   goals met: 1 of 9
33. (go_north_east b0)
   changed: (x b0) from 9.5 to 11, (y b0) from 34.5 to 36
   goals met: 1 of 9
34. (go_north_east b0)
   changed: (x b0) from 11 to 12.5, (y b0) from 36 to 37.5
   goals met: 1 of 9
35. (go_north_east b0)
   changed: (x b0) from 12.5 to 14, (y b0) from 37.5 to 39
   goals met: 1 of 9
36. (go_north_east b0)
   changed: (x b0) from 14 to 15.5, (y b0) from 39 to 40.5
   goals met: 1 of 9
37. (go_north_east b0)
   changed: (x b0) from 15.5 to 17, (y b0) from 40.5 to 42
   goals met: 1 of 9
38. (go_north_east b0)
   changed: (x b0) from 17 to 18.5, (y b0) from 42 to 43.5
   goals met: 1 of 9
39. (go_north_east b0)
   changed: (x b0) from 18.5 to 20, (y b0) from 43.5 to 45
   goals met: 1 of 9
40. (go_west b0)
   changed: (x b0) from 20 to 17
   goals met: 1 of 9
41. (go_west b0)
   changed: (x b0) from 17 to 14
   goals met: 1 of 9
42. (go_west b0)
   changed: (x b0) from 14 to 11
   goals met: 1 of 9
43. (go_west b0)
   changed: (x b0) from 11 to 8
   goals met: 1 of 9
44. (go_west b0)
   changed: (x b0) from 8 to 5
   goals met: 1 of 9
45. (go_west b0)
   changed: (x b0) from 5 to 2
   goals met: 1 of 9
46. (go_west b0)
   changed: (x b0) from 2 to -1
   goals met: 1 of 9
47. (save_person b0 p1)
   added: (saved p1)
   goals met: 2 of 9
48. (go_north_east b0)
   changed: (x b0) from -1 to 0.5, (y b0) from 45 to 46.5
   goals met: 2 of 9
49. (go_north_east b0)
   changed: (x b0) from 0.5 to 2, (y b0) from 46.5 to 48
   goals met: 2 of 9
50. (go_north_east b0)
   changed: (x b0) from 2 to 3.5, (y b0) from 48 to 49.5
   goals met: 2 of 9
51. (go_north_east b0)
   changed: (x b0) from 3.5 to 5, (y b0) from 49.5 to 51
   goals met: 2 of 9
52. (go_north_east b0)
   changed: (x b0) from 5 to 6.5, (y b0) from 51 to 52.5
   goals met: 2 of 9
53. (go_north_east b0)
   changed: (x b0) from 6.5 to 8, (y b0) from 52.5 to 54
   goals met: 2 of 9
54. (go_north_east b0)
   changed: (x b0) from 8 to 9.5, (y b0) from 54 to 55.5
   goals met: 2 of 9
55. (save_person b0 p8)
   added: (saved p8)
   goals met: 3 of 9
56. (go_north_east b0)
   changed: (x b0) from 9.5 to 11, (y b0) from 55.5 to 57
   goals met: 3 of 9
57. (go_north_east b0)
   changed: (x b0) from 11 to 12.5, (y b0) from 57 to 58.5
   goals met: 3 of 9
58. (go_north_east b0)
   changed: (x b0) from 12.5 to 14, (y b0) from 58.5 to 60
   goals met: 3 of 9
59. (go_north_east b0)
   changed: (x b0) from 14 to 15.5, (y b0) from 60 to 61.5
   goals met: 3 of 9
60. (go_north_east b0)
   changed: (x b0) from 15.5 to 17, (y b0) from 61.5 to 63
   goals met: 3 of 9
61. (go_north_east b0)
   changed: (x b0) from 17 to 18.5, (y b0) from 63 to 64.5
   goals met: 3 of 9
62. (go_north_west b0)
   changed: (x b0) from 18.5 to 17, (y b0) from 64.5 to 66
   goals met: 3 of 9
63. (go_north_west b0)
   changed: (x b0) from 17 to 15.5, (y b0) from 66 to 67.5
   goals met: 3 of 9
64. (go_north_west b0)
   changed: (x b0) from 15.5 to 14, (y b0) from 67.5 to 69
   goals met: 3 of 9
65. (go_north_west b0)
   changed: (x b0) from 14 to 12.5, (y b0) from 69 to 70.5
   goals met: 3 of 9
66. (go_north_west b0)
   changed: (x b0) from 12.5 to 11, (y b0) from 70.5 to 72
   goals met: 3 of 9
67. (go_north_west b0)
   changed: (x b0) from 11 to 9.5, (y b0) from 72 to 73.5
   goals met: 3 of 9
68. (go_north_west b0)
   changed: (x b0) from 9.5 to 8, (y b0) from 73.5 to 75
   goals met: 3 of 9
69. (save_person b0 p5)
   added: (saved p5)
   goals met: 4 of 9
70. (save_person b0 p6)
   added: (saved p6)
   goals met: 5 of 9
71. (go_north_west b0)
   changed: (x b0) from 8 to 6.5, (y b0) from 75 to 76.5
   goals met: 5 of 9
72. (go_north_west b0)
   changed: (x b0) from 6.5 to 5, (y b0) from 76.5 to 78
   goals met: 5 of 9
73. (save_person b0 p3)
   added: (saved p3)
   goals met: 6 of 9
74. (go_north_west b0)
   changed: (x b0) from 5 to 3.5, (y b0) from 78 to 79.5
   goals met: 6 of 9
75. (go_north_west b0)
   changed: (x b0) from 3.5 to 2, (y b0) from 79.5 to 81
   goals met: 6 of 9
76. (go_north_west b0)
   changed: (x b0) from 2 to 0.5, (y b0) from 81 to 82.5
   goals met: 6 of 9
77. (go_north_west b0)
   changed: (x b0) from 0.5 to -1, (y b0) from 82.5 to 84
   goals met: 6 of 9
78. (save_person b0 p2)
   added: (saved p2)
   goals met: 7 of 9
79. (go_north_west b0)
   changed: (x b0) from -1 to -2.5, (y b0) from 84 to 85.5
   goals met: 7 of 9
80. (go_north_east b0)
   changed: (x b0) from -2.5 to -1, (y b0) from 85.5 to 87
   goals met: 7 of 9
81. (save_person b0 p0)
   added: (saved p0)
   goals met: 8 of 9
82. (go_north_east b0)
   changed: (x b0) from -1 to 0.5, (y b0) from 87 to 88.5
   goals met: 8 of 9
83. (save_person b0 p4)
   added: (saved p4)
   goals met: 9 of 9
